# (a b c) * (y1 y2 y3)
import csv

alphabet = "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ"

text = "ЧЕКРДГМАОХВГЮОЖНАЦИВЧХИШСИСЯОЖЦДЩЯПРЁЛРЬЕЩМОАЯОКУУХЁРУКЛЕММЪЦГСВИДЯПОПАЪДВДЧУФВЙЫЁРУЫЕЯДВШЬЙЙЁРРОЙБЦДЫОЯЮФМЕЪЛЧЖЭШУТУЯПЛЕТАИНДЩЗЭЭТЧПАЬДЫТЛРИЯОПРДЁДНЗОЙБЁРУКЛИНСПДКЪГИЦВЕТПЯШЛЕЦШЮВНФБЬЛОЧКОКДНЛРУЬКФЮИХНОХЬЮТФЕРССФЯИПРДЕССЮЩОЖПАЯПЗИПОЩЯОЪЛАНЙНЛТОНЯПЕЪЕВФЗОЛАЕЦДЩЗМОКОКАНЧЦИБШТНХВГАЛЪЬТФДАТЖБВКУГЛСИЛЕЦВЕЦКОЪЯОЖЦДЩВЙФЧЕКРДГЙОПЕСКРЕЭЭНЁИЛФОДЩЯИСФУПКОЙАТНТОТЧНЩЗНФАОЙЛАЁПРЛОУДКОТПОГСКГКАКВММЭЧЯБОШЗАЙПРШЮЗФТШОЙЬГНАЦЁРОЙБАЛАФЧНФКМЩХТНССЮБРЫИПЛЗОСМВТЬЙЛЗФЛНАЩЧНФЩГЁЪУЬЁРЬЧВТЛСЦУТЩКГЭМАЦГАЩНТЪМОЩЪЕББЕЧЖААТЩЕЗККЗПИХЕХЬЛОМОЫМДЪАНЬОЕРЪЛЗЪЫНЮЯСАВСХЕНУРАБЕЧЬИЕРРЭЯОЙСИВЯВЦЖКЭУИЧСЩЁДПЭЩЕЯЪКБНОДУАКЕТРЙТЧИПВЪЕЕИОНЛЕСРРНЙОРБРБЕТУПДЬЙЬББРГБРИТАИТВРБШЦИНЧССНАИЧГСЬШУДРАУХЕРТЕЖГЕЮЗОЙМОЬЦЛЭЬТФТАИТУЫЙЕТПЯБЧЛЕЪШВАОШВИЬССЩТВРЯИЗЧУЬАЛГКОЛЧЧМЁЛРРЯЕЗДГПРЪБОШФУПКОЙАТНЭЧРЁЬКЯИХЕТЕДЬРВЙФЧЕЧБЕУЮБЗМСПЯОЗЕТЬЛРОЦЕШФГЪООЦЁРЖАНЬМЯЭКОЪТАГХУТИВЮЁРУКЛЕУЧБНПЬЩХЪШИЩХЕХОНЦЩНЯУИЙДТКЮКМЙНРЗАЫЙРЪСГСИОЕЦНЦЛРИЧАСЪЛЗХИОЙЯЖДНЯШАЩКХАОСВЕСШПРЪФУЦИВЧХЖЧЭИРДПОДАЧЯОЖЙОЦДКПЮКГПСТПХЭЗНКТОХУТЛЕМГЦГСВИДЧЛЕЬЕГВБЕЧЗЩВЧЗЛОГАНКЦЕЙХЕРКОСЧЕКЮСАЗОПВИЮЁРЬЙНЛФРИЭНКЖТФНОФИЭЮНЖАКОСРРЧЦЕЙХЕРКОХХЕХЛУАЩМОАОКЁХАДАЩЭОСХЕТНТЯДЬРЛОЭЛЕЯАНЬОЙСТБСПОЕЫНЕЗНФАОШНОЮКХНКЛЪЙЬЭЖЛУФОТЫДЪВИЭГСЬДКЛЗОЙПОЁХВЩГЕЩДЫТХИЭЁНАЗОТПРЪОББЛАРБРИООЦЫНАЦТЕЬЛОВТЁРАГЫЕЕХИЧЗМЛЦГСВИДРОЗЭОСЗДИЛАТССЧДШЗПЮУЙТЩРОМХЕХЬЛОЕСШПРЪФУИМОБЗММНОГМВТЛСЦНАМЛСЕЭНКЗАЖКОУЙНВЗМЕЙТЩЙРЪЙБАЛАЗАОКЕРРКЕКФИШССЖПАЪЛСЦЧГЕЩХЪПОДССЦЁЛЦЗПКЩХЪШИЩШАЩКХНКЛГЙЬЧНЕЮЮЗЛХВЭЦТЩЭИГМАЦГАЩНТЪООЦЁРЖМВЧПОЙЧЕЦБЖЗОЙБССЮТПИЛРАЬХГТОТЧЛАЙЬВААРБАХАНОБОМАТНЧЩУМОЭЦТГНОШЧЕНМОТММЪЛАПБРГБРИТАЙШТЛПОГСКГНАШШТЪКОКЫЕЧЭЧЮАИЩЁРОЙБЬЪЕЙЯСУЙНЛРРЧЛЯФГСЬДЫЩДТЩЦЕМКУЫНОУЦДЛЮИХЦДШБРГБРИПОБЖЛЙЭИНЖЫЙНТКЁЛЧШЙПЦСИВАЗПОШЦСИУИСКГЩТВЖОМАЙИЦЯПОУРЁЩУЧРАЮКАККАЗЧЛОЙЬЁЛЕЦЬУМБРГБРИЬЕЖВЫОЙРЯЬИКДПЭЗОТВТАЦРЕЗОТНЕЧЦЛЁЙЬЕВЧЯЯКЁМВЁМВЪЭИФАВГЮННИНДДПОЦТЭКОАДЫЮМАИПЗИКОКТКЧЗОЕЦЕЧМВИЫЕЕХИЮНПЪКУШЧЛАМАЦГАЩНТЪЩУЙМОРЁРЬШТЦПЯВЬЛКЁЯЁНАШЁРУЫЕЯЛАГТБССПЁЯНКЛАФЫПГШЫЮЪКЁЙТРЁРБФМОТАЮЩМИЮИТЛОЭХЕТНТЯДЬРССФЫЮЦУХМЧУТДКЩЖУГИОЕЗМУДАЩЪИМЕАБРАБНОБВЫОДВУЭКАИПВЪЕЕИОНХВПООЯВМГБОШЩМИЕСКДКЩВБЫЭИСЗКЗАТММВЛЁДНИЛПШАФГСЬЯОРНАЮРАХЁОЖГЗХКАИЯЛХЮОТАТГЦВЧМАЦГАЩНТЪЗАЪЙЯРКЛЪЯОЙКОСГНАЬУВРДЯЛАНЮХЗЁДЬЯПРВМНСАЕИВУЭИРЯПЛНТЯЯОНХЕРУХЛПОЦЭИЖЛЕМАНЗДНХИЛГЬКФМАЁ"
sequence = [alphabet.find(i) for i in text]

q = 0
last_percent = 0

with open("report.csv", "w", newline="") as report:
    spamwriter = csv.writer(report)

    for a in range(33):
        for b in range(33):
            for c in range(33):

                counter = {"О": 0, "Е": 0, "А": 0, "И": 0, "Н": 0}
                for i in range(0, len(sequence), 3):
                    letter_index = (
                        a * sequence[i] + b * sequence[i + 1] + c * sequence[i + 2]
                    ) % 33
                    if alphabet[letter_index] in counter:
                        counter[alphabet[letter_index]] += 1
                
                counter["О"] = (100 * counter["О"] / len(text) - 10.97)**2 / 10.97
                counter["Е"] = (100 * counter["Е"] / len(text) - 8.45)**2 / 8.45
                counter["А"] = (100 * counter["А"] / len(text) - 8.01)**2 / 8.01
                counter["И"] = (100 * counter["И"] / len(text) - 7.35)**2 / 7.35
                counter["Н"] = (100 * counter["Н"] / len(text) - 6.7)**2 / 6.7
                line = [(a, b, c)]
                line.extend(counter.values())
                line.append(sum(counter.values()))
                spamwriter.writerow(line)
                
                q += 1
                if round(q / 35937 * 100) > last_percent:
                    print(round(q / 35937 * 100), '%')
                    last_percent = round(q / 35937 * 100)
